name: "llm_model"
platform: "tensorrtllm" # Crucial for TensorRT-LLM backend
max_batch_size: 16 # Max batch size allowed by your TRT-LLM engine
instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]
input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [ -1 ] # Dynamic sequence length
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT32
    dims: [ -1 ]
  },
  {
    name: "position_ids"
    data_type: TYPE_INT32
    dims: [ -1 ]
  },
  {
    name: "image_input" # Name for your vision encoder output
    data_type: TYPE_FP32 # Match the output type of the vision encoder
    dims: [ -1, -1 ] # Dynamic dimensions (batch, seq_len, hidden_dim) or (seq_len, hidden_dim)
  }
]
output [
  {
    name: "output_ids"
    data_type: TYPE_INT32
    dims: [ -1 ]
  }
]